[
  {
    "KEY": "AIDSC",
    "TITLE": "AI Discourse",
    "SHORT": "AI discourse",
    "DEF": "Involving the AI in a discourse",
    "CONTRIB": "Boris STEIPE <boris.steipe@utoronto.ca>",
    "VERSION": "v. 2023-05-21",
    "UPDATE": "2023-05-21T17:00-0400",
    "STATUS": "dev",
    "STYLE": "show:TRUE; col:#d1f7f2; size:10; order:91",
    "META": "",
    "PARENT.KEY": "AISYN",
    "PARENT.NOTES": "Reference tree: IS-A relationship.",
    "ISA.KEYS": "",
    "ISA.NOTES": "",
    "RESULTSFROM.KEYS": "",
    "RESULTSFROM.NOTES": "",
    "GOVERNEDBY.KEYS": "",
    "GOVERNEDBY.NOTES": "",
    "COMPONENTOF.KEYS": "",
    "COMPONENTOF.NOTES": "",
    "TASK": "The AI Discourse pattern involves engaging the AI in dynamic, multi-turn conversations. This method promotes cognitive engagement and the co-creation of knowledge - to be able to do this through a computational device opens up new horizons of learning. The AI's ability to converse in natural language, generate diverse perspectives, question assumptions, and make beliefs explicit, can greatly enrich the learning environment. Nevertheless, it's important to recognize that interacting with a non-human entity like an AI carries a dual nature: While some find the lack of emotional context alienating, others find it liberating, as it can minimize judgment and bias. Challenges to the success of the pattern include the AI's limited context window, which can lead to perceived incoherence. And as always, it is crucial that learners critically engage with the AI's responses and validate information independently where that is necessary. To enhance the discourse, the AI can be directed to adopt a specific persona, which can foster learner engagement and create a more immersive learning experience.",
    "DETAILS": "",
    "AI": "",
    "IMPLEMENTATION": "",
    "CANBEREPLACEDWITH.KEYS": "",
    "CANBEREPLACEDWITH.NOTES": "",
    "FIGURE.URL": "",
    "FIGURE.CAPTION": "",
    "HASCOMPONENT.KEYS": "",
    "HASCOMPONENT.NOTES": "",
    "ALTERNATIVEFORM.KEYS": "",
    "ALTERNATIVEFORM.NOTES": "",
    "RESULTSIN.KEYS": "",
    "RESULTSIN.NOTES": ""
  }
]
