[
  {
    "KEY": "AISYN",
    "TITLE": "AI Synthesized Material",
    "SHORT": "AI synth",
    "DEF": "Synthesis of educational material by an AI model or in discourse with an AI model",
    "CONTRIB": "Boris STEIPE <boris.steipe@utoronto.ca>",
    "VERSION": "v. 2023-05-21",
    "UPDATE": "2023-05-21T17:00-0400",
    "STATUS": "dev",
    "STYLE": "show:TRUE; col:#d1f7f2; size:10; order:75",
    "META": "",
    "PARENT.KEY": "EDACT",
    "PARENT.NOTES": "Reference tree: IS-A relationship.",
    "ISA.KEYS": "",
    "ISA.NOTES": "",
    "RESULTSFROM.KEYS": "",
    "RESULTSFROM.NOTES": "",
    "GOVERNEDBY.KEYS": "",
    "GOVERNEDBY.NOTES": "",
    "COMPONENTOF.KEYS": "",
    "COMPONENTOF.NOTES": "",
    "TASK": "In the AI Synthesized Material pattern, the AI model generates content, or aids in its creation. This contributes specialized background knowledge, crafts unique, context-aware perspectives and can support discourse. Moreover the AI is available all-day, worldwide, it is patient and non-judgemental. The pattern is most useful when it augments users' efforts through critique, elaboration, and iterated improvement. Challenges include occasional inaccuracies in generated content on the side of the AI, and an uncritical use of the results by users, which may lead to over-reliance. For effective use, be aware of the technical background and the limitations the technology has, craft prompts well, always approach work as collaboration, in and take great care to have the AI work with you, not for you. The cognitive engagement that results from first attempting the task oneself is crucial. Drafting possible responses has the added benefit of providing examples of scope and form that can be used in the AI prompt. The AI is a powerful tool, if used well and users will benefit greatly from training. Trianing  understand the strengths and limitations of AI models and how best to interact with them. Training could include topics like how to draft effective prompts, how to interpret and verify AI-generated content, and how to maintain a meaningful, human-centered editing process in the context of AI augmentation.",
    "DETAILS": "",
    "AI": "",
    "IMPLEMENTATION": "",
    "CANBEREPLACEDWITH.KEYS": "",
    "CANBEREPLACEDWITH.NOTES": "",
    "FIGURE.URL": "",
    "FIGURE.CAPTION": "",
    "HASCOMPONENT.KEYS": "",
    "HASCOMPONENT.NOTES": "",
    "ALTERNATIVEFORM.KEYS": "",
    "ALTERNATIVEFORM.NOTES": "",
    "RESULTSIN.KEYS": "",
    "RESULTSIN.NOTES": ""
  }
]
