{
	"# key": "A five letter, uppercase, alphanumeric, mnemonic string. It must be unique among all PLAAI patterns.",
	"key": "PSPEC",

	"# title": "Describe the pattern in less than four words",
	"title": "PLAAI pattern specification",

	"# parent": "Exactly one IS-A relationship that is considered the parent pattern in the ontology.",
	"parent": "PMETA",

	"# short": "One or two words for display in the reference tree",
	"short": "Pattern spec.",

	"definition": "One sentence to define the pattern (used e.g. in hovertext).",

	"# contributors": "An array of names and emails",
	"contributors": ["Boris Steipe <boris.steipe@utoronto.ca>"],

	"# version": "The pattern structure version, given as the date: v. YYYY-MM-DD.",
	"version": "v. 2023-05-18",

	"# last update": "As per ISO 8601: format(Sys.time(), '%Y-%m-%dT%H:%M%z')",
	"last update": "2023-05-18T19:11-0400",

	"# status": "One of {stub, dev, public}. stub status requires a completed meta block and a task description. dev status requires keys for sources, exchangeables, and targets to be listed. public status is a worked out pattern, though it may not yet be in its final form.",
	"status": "public",

	"# in-reference": "Boolean value: whether the pattern appears in the reference tree or list.",
	"in reference": false,

	"# Is-A": "This object lists patterns that define a category in which this pattern is contained.",
	"IS-A": {
		"# keys": "An array of keys. At least one key must be present: the parent-key designated in the meta block.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	},

	"# ARISES-FROM": "This object lists patterns that create the pattern or have it as their outcome. Paired with the RESULTS-IN relationship, it allows defining sequences of patterns.",
	"ARISES-FROM": {
		"# keys": "An array of keys. May be null.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	},

	"# GOVERNED-BY": "This object lists patterns that define rules, principles, or standards for the pattern.",
	"GOVERNED-BY": {
		"# keys": "An array of keys. May be null.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	},

	"# COMPONENT-OF": "This object lists patterns that are more complex systems or structures that contain the pattern.",
	"COMPONENT-OF": {
		"# keys": "An array of keys. May be null.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	},

	"task": "The mandatory task description is the heart of the pattern: in three or four concise sentences, the main purpose of the pattern is described as a task which the pattern intends to solve, and the main benefits are listed. Constraints that reduce the effectiveness of the solution are also stated, and how those constraints can be addressed. Therefore the task description defines the reason for the pattern to exist and outlines what needs to be done to make it work well. The description is thus structured by answering the questions: (1) What is it? (2) Why is it useful or important? (3) What challenges affect it? (4) What makes it work well?",

	"details": "This section describes details of the pattern. The section must be present but may be null.",

	"AI concerns": "This section describes specifically how AI can augment the pattern’s function. Possible negative impacts of AI may be included, as well as strategies to thwart AI use by learners if necessary. It contains prompts, where indicated and links to resources. The section must be present but may be null.",

	"implementation": "Clear, specific, and actionable implementation instructions are given that address problems and make use of the AI opportunities discussed above. This is a recipe of how the pattern is put into practice. The section must be present but may be null.",

	"# EXCHANGEABLE-WITH": "Patterns that can replace the pattern in a particular context.",
	"EXCHANGEABLE-WITH": {
		"# keys": "An array of keys. May be null.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	},

	"# figure": "A structured diagram that provides a graphical summary of the pattern.",
	"figure": {
		"# url": "The URL of a figure in svg, jpg, or png format. May be null",
		"url": null,
		"# caption": "A figure caption. May be null.",
		"caption": null
	},

	"# HAS-FORM": "Patterns that describe alternative formats or modes.",
	"HAS-FORM": {
		"# keys": "An array of keys. May be null.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	},

	"# HAS-COMPONENT": "Patterns that can function as integral parts and provide content, structure, and additional context, or compose systems.",
	"HAS-COMPONENT": {
		"# keys": "An array of keys. May be null.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	},

	"# RESULTS-IN": "This object lists patterns that are the results of the pattern. Paired with the ARISES-FROM relationship, it allows defining sequences of patterns.",
	"RESULTS-IN": {
		"# keys": "An array of keys. May be null.",
		"keys": ["___"],
		"notes": "Notes on the keys, if any. May be null."
	}
}
